Revit 2027 API
BuiltInFailures.DividedPathFailures Class
 Failures related to divided path operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.DividedPathFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DividedPathFailures
Public NotInheritable Class DividedPathFailures
public ref class DividedPathFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DividedPathFailures = class end
The BuiltInFailures.DividedPathFailures type exposes the following members.
Properties
Name | Description
DividedPathCannotApplyDivideSettings |  Default Divide settings cannot be applied to Divided Path.
DividedPathCannotBeMirroredWithoutItsCurves |  Divided path cannot be mirrored without its curves.
DividedPathCannotCreateFromGeometry |  Highlighted geometry contains a path or edge that could not be divided.
DividedPathDistanceTooSmall |  Distance is too small.
DividedPathIndentsOverlap |  Beginning indent and end indent overlap.
DividedPathIntersectionPolycurveParamsStepFailed |  Intersection failed.
DividedPathInvalidNumberOfPoints |  End indent is too large.
DividedPathLayoutStepFailed |  Layout algorithm failed.
DividedPathUpdateMergedPointKeysStepFailed |  Merging failed.
Top
See Also
Reference
Autodesk.Revit.DB Namespace